---
type: ImportOptions3DM
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# ImportOptions3DM

`Autodesk.Revit.DB.ImportOptions3DM` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ImportOptions3DM | — | `` |
| Constructor | ImportOptions3DM | 2022 | `public ImportOptions3DM ()` |